{
    "lang": {
        "es": "Español",
        "en": "Inglés",
        "ca": "Catalán",
        "fr": "Francés",
        "de": "Alemán"
    },
    "navigation": {
		"home": "Inicio",
        "about": "Acerca",
        "skills": "Habilidades",
        "projects": "Proyectos",
        "contact-me": "Contacto",
        "others": "Otros",
        "flag": "fi fi-es"
    },
    "home": {
        "hello": "¡Hola! soy Carlos",
        "header": "Desarrollador Back-End.",
        "description": "Graduado en 2021 en Ingeniería del Software por la Universidad de Oviedo, soy un desarrollador que combina creatividad con un alto nivel de conocimiento para cumplir con cualquier proyecto de una forma eficiente y completa.",
        "quote": "Crea el código más simple, resuelve los problemas más complejos",
        "more": "Más sobre mí"
    },
    "about": {
        "header": "",
		"download": "Descargar",
		"download-url": "/cv/CV-Es.pdf",
        "education": {
            "title": "Educación",
            "subtitle": "Graduado en 2021 en Ingeniería del Software por la Universidad de Oviedo, en la Escuela de Ingeniería Informática."
        },
        "languages": {
            "title": "Idiomas",
            "subtitle": "Nivel avanzado de habla, lectura y escritura en inglés y nativo en español."
        },
        "experience": {
            "title": "Experiencia",
            "subtitle": "Llevo trabajando en diferentes proyectos desde antes de acabar la carrera universitaria. Actualmente trabajo en Idealista.com, la empresa más importante de España, Portugal e Italia en su sector."
        },
		"life": {
			"title": "Calendario",
			"years": "años",
			"months": "meses",
			"days": "días"
		},
		"location": {
			"title": "Localización"
		},
		"socials": {
			"title": "Redes sociales"
		}
    },
    "skills": {
        "header": "Llevo casi una década trabajando en diferentes proyectos, tanto en inglés como en español. Actualmente trabajo en Idealista.com, la empresa más importante de España, Portugal e Italia en su sector",
        "front": {
            "title": "Desarrollo Front-End",
            "subtitle": "Habilidades notables en diseño de interfaces. Control de validación de accesibilidad y adaptabilidad web."
        },
        "back": {
            "title": "Desarrollo Back-End",
            "subtitle": "Java, PHP, JavaScript, C#, C++, Python y TypeScript, así como tecnologías como Angular, NodeJS, Phalcon, Symfony, SpringBoot y React, entre otras."
        },
        "api": {
            "title": "Administración de API",
            "subtitle": "Conocimiento de creación, administración y mantenimiento de APIs."
        },
        "database": {
            "title": "Administración de base de datos",
            "subtitle": "Amplios conocimientos en bases de datos tanto relacionales como documentales."
        },
        "business": {
            "title": "Conocimiento de Negocio",
            "subtitle": "Amplios conocimientos en Patrones de Diseño y Diseño de Software, así como conceptos avanzados de Arquitectura de Software y principios de seguridad y consistencia de datos."
        },
        "tester": {
            "title": "Tester",
            "subtitle": "Conocimiento avanzado de testing. Pruebas unitarias, de integración, de carga, de rendimiento etc."
        },
		"social": {
            "title": "Habilidades sociales",
            "subtitle": "Trabajo en equipo, liderazgo, actitud positiva. Escucha activa, paciencia y asertividad."
        }
    },
    "projects": {
        "header": "Aquí hay una lista de mis proyectos anteriores.",
        "see-source-code": "Ver código fuente",
        "realestate": {
            "title": "Aplicación de Gestión Inmobiliaria",
            "subtitle": "Hecha con NodeJS, esta aplicación permite al usuario administrar todos los aspectos relacionados con el alquiler o la compra de propiedades, así como manejar todo lo relacionado con comunicaciones, documentos o medios."
        },
        "runner": {
            "title": "Juego Runner",
            "subtitle": "Este juego fue un experimento para intentar crear una aplicación de juego con JavaScript puro."
        },
        "shooter": {
            "title": "Juego Shooter",
            "subtitle": "Este videojuego de disparos está creado en Unreal Engine 4 y le permite al usuario sobrevivir a diferentes rondas contra diferentes amenazas. Para defenderse, puede usar diferentes armas o potenciadores."
        },
        "music": {
            "title": "Aplicación de tienda de música",
            "subtitle": "Una sencilla aplicación de tienda de música hecha en SpringBoot. Permite al usuario comprar, vender o reproducir diferentes pistas de música."
        }
    },
    "contact-me": {
        "header": "Estaré encantado de responder cualquier pregunta que tenga.",
        "name": "Nombre",
        "email": "Email",
        "subject": "Asunto",
        "message": "Mensaje",
        "send": "Enviar",
        "feedback-error": "Ocurrió un error al enviar su correo. Inténtelo más tarde",
        "feedback-success": "Mensaje enviado con éxito",
        "captcha": "Por favor, acepte el captcha",
		"value-1": "Construyamos cosas increíbles,",
		"value-2": "juntos"
    },
    "others": {
        "header": "Soy un estudiante autodidacta y aficionado al modelado 3d. Para ello utilizo la herramienta de creación Blender. Estas son algunas de mis creaciones recientes."
    },
    "footer": {
        "header": "Diseñado y desarrollado por Carlos Gómez Colmenero"
    }
}